{
  "Errors": [
    {
      "Severity": "error",
      "Message": "document-link: present for classes. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for inheritance. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for basics. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for constructors. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for method-overloading. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for properties. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for null. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for numbers. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for booleans. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for chars. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for arrays. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for dictionaries. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for dates. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for enums. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for floating-point-numbers. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for strings. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for flag-enums. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for user-defined-exceptions. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for user-defined-exceptions2. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for equality. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for tuples. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for randomness. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for parameters. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for conditionals-switch. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for object-initializers. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for resource-cleanup. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "document-link: present for time. This will be ignored when generating the report\n",
      "Source": "exercise"
    },
    {
      "Severity": "error",
      "Message": "Too many errors reading exercises.json - see exercise-errors.json",
      "Source": "exercise"
    }
  ]
}